tests/load/config.yaml
config:
  target: "{{$processEnvironment.API_ENDPOINT}}"
  phases:
    - duration: 30
      arrivalRate: 5
      name: Warm up
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: Ramp up load
    - duration: 120
      arrivalRate: 20000
      name: Sustained load
scenarios:
  - flow:
      - post:
          url: "/sqs"
          json:
            letter: "A"
      - post:
          url: "/lambda"
          json:
            letter: "A"
      - post:
          url: "/sns"
          json:
            letter: "A"
      # - post:
      #     url: "/sfn"
      #     json:
      #       letter: "A"
      # - post:
      #     url: "/eb"
      #     json:
      #       letter: "A"
      # - post:
      #     url: "/ddb"
      #     json:
      #       letter: "A"